### AWS UAT Plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/29032c40-8652-46e3-95a4-ac32740af3d1/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudflare_uat.cloudflare_record.cname will be created
  + resource "cloudflare_record" "cname" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "uat"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "45371d5e2e41b9575d6e48c8c614d895"
    }

  # module.s3_uat.aws_s3_bucket.site will be created
  + resource "aws_s3_bucket" "site" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "uat.marshmallowmeat.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Name"            = "uat.marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + tags_all                    = {
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Name"            = "uat.marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_uat.aws_s3_bucket_acl.site will be created
  + resource "aws_s3_bucket_acl" "site" {
      + acl    = "public-read"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_uat.aws_s3_bucket_policy.site will be created
  + resource "aws_s3_bucket_policy" "site" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3_uat.aws_s3_bucket_website_configuration.site will be created
  + resource "aws_s3_bucket_website_configuration" "site" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule {
          + condition {
              + http_error_code_returned_equals = (known after apply)
              + key_prefix_equals               = (known after apply)
            }

          + redirect {
              + host_name               = (known after apply)
              + http_redirect_code      = (known after apply)
              + protocol                = (known after apply)
              + replace_key_prefix_with = (known after apply)
              + replace_key_with        = (known after apply)
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudflare  = {
      + cloudflare_record_cname = {
          + allow_overwrite = false
          + comment         = null
          + created_on      = (known after apply)
          + data            = []
          + hostname        = (known after apply)
          + id              = (known after apply)
          + metadata        = (known after apply)
          + modified_on     = (known after apply)
          + name            = "uat"
          + priority        = null
          + proxiable       = (known after apply)
          + proxied         = true
          + tags            = null
          + timeouts        = null
          + ttl             = 1
          + type            = "CNAME"
          + value           = (known after apply)
          + zone_id         = "45371d5e2e41b9575d6e48c8c614d895"
        }
    }
  + s3          = {
      + tags              = {
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "marshmallowmeat.com"
          + "Name"            = "uat.marshmallowmeat.com"
          + "Project"         = "tf-web"
          + "Terraform"       = "true"
        }
      + website_bucket_id = (known after apply)
      + website_domain    = (known after apply)
      + website_endpoint  = (known after apply)
    }
  + site_domain = "uat.marshmallowmeat.com"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.cloudflare_uat.cloudflare_record.cname will be created%0A  + resource "cloudflare_record" "cname" {%0A      + allow_overwrite = false%0A      + created_on      = (known after apply)%0A      + hostname        = (known after apply)%0A      + id              = (known after apply)%0A      + metadata        = (known after apply)%0A      + modified_on     = (known after apply)%0A      + name            = "uat"%0A      + proxiable       = (known after apply)%0A      + proxied         = true%0A      + ttl             = 1%0A      + type            = "CNAME"%0A      + value           = (known after apply)%0A      + zone_id         = "45371d5e2e41b9575d6e48c8c614d895"%0A    }%0A%0A  # module.s3_uat.aws_s3_bucket.site will be created%0A  + resource "aws_s3_bucket" "site" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "uat.marshmallowmeat.com"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Name"            = "uat.marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all                    = {%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Name"            = "uat.marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = (known after apply)%0A          + allowed_methods = (known after apply)%0A          + allowed_origins = (known after apply)%0A          + expose_headers  = (known after apply)%0A          + max_age_seconds = (known after apply)%0A        }%0A%0A      + grant {%0A          + id          = (known after apply)%0A          + permissions = (known after apply)%0A          + type        = (known after apply)%0A          + uri         = (known after apply)%0A        }%0A%0A      + lifecycle_rule {%0A          + abort_incomplete_multipart_upload_days = (known after apply)%0A          + enabled                                = (known after apply)%0A          + id                                     = (known after apply)%0A          + prefix                                 = (known after apply)%0A          + tags                                   = (known after apply)%0A%0A          + expiration {%0A              + date                         = (known after apply)%0A              + days                         = (known after apply)%0A              + expired_object_delete_marker = (known after apply)%0A            }%0A%0A          + noncurrent_version_expiration {%0A              + days = (known after apply)%0A            }%0A%0A          + noncurrent_version_transition {%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A%0A          + transition {%0A              + date          = (known after apply)%0A              + days          = (known after apply)%0A              + storage_class = (known after apply)%0A            }%0A        }%0A%0A      + logging {%0A          + target_bucket = (known after apply)%0A          + target_prefix = (known after apply)%0A        }%0A%0A      + object_lock_configuration {%0A          + object_lock_enabled = (known after apply)%0A%0A          + rule {%0A              + default_retention {%0A                  + days  = (known after apply)%0A                  + mode  = (known after apply)%0A                  + years = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + replication_configuration {%0A          + role = (known after apply)%0A%0A          + rules {%0A              + delete_marker_replication_status = (known after apply)%0A              + id                               = (known after apply)%0A              + prefix                           = (known after apply)%0A              + priority                         = (known after apply)%0A              + status                           = (known after apply)%0A%0A              + destination {%0A                  + account_id         = (known after apply)%0A                  + bucket             = (known after apply)%0A                  + replica_kms_key_id = (known after apply)%0A                  + storage_class      = (known after apply)%0A%0A                  + access_control_translation {%0A                      + owner = (known after apply)%0A                    }%0A%0A                  + metrics {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A%0A                  + replication_time {%0A                      + minutes = (known after apply)%0A                      + status  = (known after apply)%0A                    }%0A                }%0A%0A              + filter {%0A                  + prefix = (known after apply)%0A                  + tags   = (known after apply)%0A                }%0A%0A              + source_selection_criteria {%0A                  + sse_kms_encrypted_objects {%0A                      + enabled = (known after apply)%0A                    }%0A                }%0A            }%0A        }%0A%0A      + server_side_encryption_configuration {%0A          + rule {%0A              + bucket_key_enabled = (known after apply)%0A%0A              + apply_server_side_encryption_by_default {%0A                  + kms_master_key_id = (known after apply)%0A                  + sse_algorithm     = (known after apply)%0A                }%0A            }%0A        }%0A%0A      + versioning {%0A          + enabled    = (known after apply)%0A          + mfa_delete = (known after apply)%0A        }%0A%0A      + website {%0A          + error_document           = (known after apply)%0A          + index_document           = (known after apply)%0A          + redirect_all_requests_to = (known after apply)%0A          + routing_rules            = (known after apply)%0A        }%0A    }%0A%0A  # module.s3_uat.aws_s3_bucket_acl.site will be created%0A  + resource "aws_s3_bucket_acl" "site" {%0A      + acl    = "public-read"%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + access_control_policy {%0A          + grant {%0A              + permission = (known after apply)%0A%0A              + grantee {%0A                  + display_name  = (known after apply)%0A                  + email_address = (known after apply)%0A                  + id            = (known after apply)%0A                  + type          = (known after apply)%0A                  + uri           = (known after apply)%0A                }%0A            }%0A%0A          + owner {%0A              + display_name = (known after apply)%0A              + id           = (known after apply)%0A            }%0A        }%0A    }%0A%0A  # module.s3_uat.aws_s3_bucket_policy.site will be created%0A  + resource "aws_s3_bucket_policy" "site" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3_uat.aws_s3_bucket_website_configuration.site will be created%0A  + resource "aws_s3_bucket_website_configuration" "site" {%0A      + bucket           = (known after apply)%0A      + id               = (known after apply)%0A      + routing_rules    = (known after apply)%0A      + website_domain   = (known after apply)%0A      + website_endpoint = (known after apply)%0A%0A      + error_document {%0A          + key = "index.html"%0A        }%0A%0A      + index_document {%0A          + suffix = "index.html"%0A        }%0A%0A      + routing_rule {%0A          + condition {%0A              + http_error_code_returned_equals = (known after apply)%0A              + key_prefix_equals               = (known after apply)%0A            }%0A%0A          + redirect {%0A              + host_name               = (known after apply)%0A              + http_redirect_code      = (known after apply)%0A              + protocol                = (known after apply)%0A              + replace_key_prefix_with = (known after apply)%0A              + replace_key_with        = (known after apply)%0A            }%0A        }%0A    }%0A%0APlan: 5 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + cloudflare  = {%0A      + cloudflare_record_cname = {%0A          + allow_overwrite = false%0A          + comment         = null%0A          + created_on      = (known after apply)%0A          + data            = []%0A          + hostname        = (known after apply)%0A          + id              = (known after apply)%0A          + metadata        = (known after apply)%0A          + modified_on     = (known after apply)%0A          + name            = "uat"%0A          + priority        = null%0A          + proxiable       = (known after apply)%0A          + proxied         = true%0A          + tags            = null%0A          + timeouts        = null%0A          + ttl             = 1%0A          + type            = "CNAME"%0A          + value           = (known after apply)%0A          + zone_id         = "45371d5e2e41b9575d6e48c8c614d895"%0A        }%0A    }%0A  + s3          = {%0A      + tags              = {%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "marshmallowmeat.com"%0A          + "Name"            = "uat.marshmallowmeat.com"%0A          + "Project"         = "tf-web"%0A          + "Terraform"       = "true"%0A        }%0A      + website_bucket_id = (known after apply)%0A      + website_domain    = (known after apply)%0A      + website_endpoint  = (known after apply)%0A    }%0A  + site_domain = "uat.marshmallowmeat.com"%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `Infra`*